var name = "Peter"
var number = 200
var isTrue = true
var nothing = null
var empty = undefined
var list = []
var ref = {}
var func = function(){}

// 선언 키워드 : 자바스크립트는 다른 컴파일 언아와 달리 값을 변수로 저장할 때 어떤 유형
// 인지 명시하지 않아도 된다. 그리고 일관된 var 키워드를 맨 앞에 작성하여 변수를 선언
// 한다. 프로그래밍할 때 값의 유형을 일일이 명시하지 않으면 런타임 시 변수의 값에 의해
// 동적으로 유형이 결정된다. 이를 동적 바인딩이라 한다.

// 변수명 : 변수를 선언할 때 선원 키워드 다음에 변수명을 작성한다. 변수명을 지정하는것은
// 개발자의 재량이지만 피해야하는 변수명이 존재한다. 그것은 키워드이다. 자바스크립트 언어
// 에서 사용하고 있는 키워드를 변수명으로 선언하게 되면 에러가 발생한다.

// 등호(=) : 등호를 사이에 두고 완쪽에 변수명과 오른쪽에 값을 작성한다.
// 변수명이 정의 된 변수 메모리에 값을 대입한다는 의미

// 값 :  자바스크립트에서 변수에 넣을 수 있는 값은 다양하다. 
// 간단하게는 단일 자료형의 값부터 표현식, 함수까지 값으로 대입될 수 있다.